{"title":"13 Assassins ","year":2010,"Time":126,"rating":88,"genre":"Action","description":"In this remake of a 1963 film based on historical events, Shinzaemon Shimada leads a team of assassins in 19th-century Japan to eliminate the ruthless Lord Naritsugu Matsudaira, who is wreaking havoc against his own people. Hired secretly by a government official hoping to end Matsudaira's reign of terror, Shimada recruits the best samurai in Japan and then sets a trap for the lord's large contingent of faithful bodyguards.","director":"Takashi Miike","poster":"https:\/\/resizing.flixster.com\/-XZWEFOiG9uZANU3-LwBSKXx1Nk=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/-XZAfHZM39UwaGJIFWKAE8fS0ak=\/v3\/t\/assets\/p8458319_p_v8_aq.jpg"}
{"title":"A Better Tomorrow","year":1986,"Time":91,"rating":89,"genre":"Action","description":"A Hong Kong policeman (Leslie Cheung) blames his reformed-gangster brother (Chow Yun-Fat) for the death of their father.","director":"John Woo","poster":"https:\/\/resizing.flixster.com\/msgafKMJlyXvpw7tlSvX4l17wFA=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/-XZAfHZM39UwaGJIFWKAE8fS0ak=\/v3\/t\/assets\/p16378_p_v8_aa.jpg"}
{"title":"Aliens","year":1986,"Time":137,"rating":94,"genre":"Action","description":"After floating in space for 57 years, Lt. Ripley's (Sigourney Weaver) shuttle is found by a deep space salvage team. Upon arriving at LV-426, the marines find only one survivor, a nine year old girl named Newt (Carrie Henn). But even these battle-hardened marines with all the latest weaponry are no match for the hundreds of aliens that have invaded the colony.","director":"Jame Cameron","poster":"https:\/\/resizing.flixster.com\/-5ikyG7jMXnwUBPoopxKyGt7Ydo=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/-XZAfHZM39UwaGJIFWKAE8fS0ak=\/v3\/t\/assets\/p9384_p_v8_bk.jpg"}
{"title":"Avengers: Endgame","year":2023,"Time":181,"rating":90,"genre":"Action","description":"Adrift in space with no food or water, Tony Stark sends a message to Pepper Potts as his oxygen supply starts to dwindle. Meanwhile, the remaining Avengers -- Thor, Black Widow, Captain America and Bruce Banner -- must figure out a way to bring back their vanquished allies for an epic showdown with Thanos -- the evil demigod who decimated the planet and the universe.","director":"Anthony Russo","poster":"https:\/\/resizing.flixster.com\/PUYKuy0g9kGg9q4iPoUQY6dY_a4=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/fC7nU6iTRQk02tS0SDS1ylx-G34=\/ems.cHJkLWVtcy1hc3NldHMvbW92aWVzL2QxZjE5ZDgzLTRiY2MtNDFkYS04NWQ4LTRkYzc1ZTAwNWE2NC53ZWJw"}
{"title":"A View to a Kill","year":1985,"Time":131,"rating":40,"genre":"Action","description":"After recovering a microchip from the body of a deceased colleague in Russia, British secret agent James Bond (Roger Moore) discovers that the technology has the potential for sinister applications. Investigating further, Bond is led to Max Zorin (Christopher Walken), the head of Zorin Industries. Soon Agent 007 faces off against the villainous Zorin and his tough Amazonian bodyguard, May Day (Grace Jones), who are scheming to cause massive destruction that will eliminate the competition.","director":"John Glen","poster":"https:\/\/s3.amazonaws.com\/nightjarprod\/content\/uploads\/sites\/249\/2023\/07\/27183349\/A-View-to-a-Kill-Vintage-Movie-Poster-Original-1-Sheet-27x41-7083-scaled.jpeg"}
{"title":"Baby Driver","year":2017,"Time":113,"rating":86,"genre":"Action","description":"Talented getaway driver Baby (Ansel Elgort) relies on the beat of his personal soundtrack to be the best in the game. After meeting the woman (Lily James) of his dreams, he sees a chance to ditch his shady lifestyle and make a clean break. Coerced into working for a crime boss (Kevin Spacey), Baby must face the music as a doomed heist threatens his life, love and freedom.","director":"Edgar Wright","poster":"https:\/\/resizing.flixster.com\/i7oGzoA_QwyD5MeE-TNIZx797s4=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/Vbat7sd_HYgR3_SPcJ3Y8Pcrjl0=\/ems.cHJkLWVtcy1hc3NldHMvbW92aWVzL2QwZmU3ZDZlLTRhMmItNDgxMy04NjM1LWViNmE3ZjkzNjhkNC53ZWJw"}
{"title":"Bad Boys","year":1995,"Time":118,"rating":78,"genre":"Action","description":"Miami-Dade detectives Mike Lowrey (Will Smith) and Marcus Burnett (Martin Lawrence) blow a fuse when $100 million worth of heroin they recently confiscated is heisted from station headquarters. Suspecting it was an inside job, Internal Affairs gives them five days to track down the drugs before they shut down the narcotics division. Action meets farce when Marcus is compelled to masquerade as his partner in order to gain the trust of a call girl (Tea Leoni), a key witness in their investigation.","director":"Michael Bay","poster":"https:\/\/resizing.flixster.com\/SbFiIY1mFVUG_YFvjcmKhSuKnDs=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/-XZAfHZM39UwaGJIFWKAE8fS0ak=\/v3\/t\/assets\/p16624_p_v8_ad.jpg"}
{"title":"Batman","year":1989,"Time":126,"rating":84,"genre":"Action","description":"Having witnessed his parents' brutal murder as a child, millionaire philanthropist Bruce Wayne (Michael Keaton) fights crime in Gotham City disguised as Batman, a costumed hero who strikes fear into the hearts of villains. But when a deformed madman who calls himself \"The Joker\" (Jack Nicholson) seizes control of Gotham's criminal underworld, Batman must face his most ruthless nemesis ever while protecting both his identity and his love interest, reporter Vicki Vale (Kim Basinger).","director":"Tim Butron","poster":"https:\/\/media.discordapp.net\/attachments\/894196629291286531\/1173606296260448327\/ems.png?ex=65649109&is=65521c09&hm=c1dcdd97d5376f8ae0898867235302270d8a8a5d1f2abf5dc5e202ae29fba18c&="}
{"title":"Batman Returns","year":1992,"Time":126,"rating":73,"genre":"Action","description":"The monstrous Penguin (Danny DeVito), who lives in the sewers beneath Gotham, joins up with wicked shock-headed businessman Max Shreck (Christopher Walken) to topple the Batman (Michael Keaton) once and for all. But when Shreck's timid assistant, Selina Kyle (Michelle Pfeiffer), finds out, and Shreck tries to kill her, she is transformed into the sexy Catwoman. She teams up with the Penguin and Shreck to destroy Batman, but sparks fly unexpectedly when she confronts the caped crusader.","director":"Tim Butron","poster":"https:\/\/media.discordapp.net\/attachments\/894196629291286531\/1173606565853544528\/MV5BOGZmYzVkMmItM2NiOS00MDI3LWI4ZWQtMTg0YWZkODRkMmViXkEyXkFqcGdeQXVyODY0NzcxNw.png?ex=65649149&is=65521c49&hm=b23d475934a349f4a312f2f55ca39af842bd932983085c91c5be9b3e69cc044e&=&width=403&height=597"}
{"title":"Battle Royale","year":2000,"Time":114,"rating":89,"genre":"Action","description":"42 9th graders are sent to a deserted island. They are given a map, food, and various weapons. An explosive collar is fitted around their neck. If they break a rule, the collar explodes. Their mission: kill each other and be the last one standing. The last survivor is allowed to leave the island. If there is more than one survivor, the collars explode and kill them all.","director":"Kinji Fukasaku","poster":"https:\/\/resizing.flixster.com\/PJP0GZOS5auBu3t-BtoqX9etUv0=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/-XZAfHZM39UwaGJIFWKAE8fS0ak=\/v3\/t\/NowShowing\/26615\/26615_aa.jpg"}
{"title":"Black Panther ","year":2018,"Time":134,"rating":79,"genre":"Action","description":"After the death of his father, T'Challa returns home to the African nation of Wakanda to take his rightful place as king. When a powerful enemy suddenly reappears, T'Challa's mettle as king -- and as Black Panther -- gets tested when he's drawn into a conflict that puts the fate of Wakanda and the entire world at risk. Faced with treachery and danger, the young king must rally his allies and release the full power of Black Panther to defeat his foes and secure the safety of his people.","director":"Ryan Coogler","poster":"https:\/\/resizing.flixster.com\/AFkjaz-8Uf7x02u48NfpAXa2mA4=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/KBlur3LaA-y1U1yt6_Y2uO25ozA=\/ems.cHJkLWVtcy1hc3NldHMvbW92aWVzLzMxOGI1YzBhLWMyMjEtNGUxMS1iM2Q0LWQ4OGMyYzQyZjQyYS53ZWJw"}
{"title":"Blade ","year":1998,"Time":120,"rating":78,"genre":"Action","description":"A half-mortal, half-immortal is out to avenge his mother's death and rid the world of vampires. The modern-day technologically advanced vampires he is going after are in search of his special blood type needed to summon an evil god who plays a key role in their plan to execute the human race.","director":"Stephen Norrington","poster":"https:\/\/resizing.flixster.com\/L9mIkeVNLquEY1VHo2m_bfrmKcc=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/-XZAfHZM39UwaGJIFWKAE8fS0ak=\/v3\/t\/assets\/p21512_p_v8_ad.jpg"}
{"title":"Braveheart","year":1995,"Time":177,"rating":85,"genre":"Action","description":"Tells the story of the legendary thirteenth century Scottish hero named William Wallace (Mel Gibson). Wallace rallies the Scottish against the English monarch and Edward I (Peter Hanly) after he suffers a personal tragedy by English soldiers. Wallace gathers a group of amateur warriors that is stronger than any English army.","director":"Mel Gibson","poster":"https:\/\/resizing.flixster.com\/Zts8ZniFVMUPo0oOcVfB4ulc_kE=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/-XZAfHZM39UwaGJIFWKAE8fS0ak=\/v3\/t\/assets\/p16782_p_v12_au.jpg"}
{"title":"Brotherhood of the Wolf","year":2011,"Time":142,"rating":78,"genre":"Action","description":"In a rural province of France, a mysterious creature is laying waste to the countryside, savagely killing scores of women and children. Unseen, possessed of enormous strength and a human intelligence, the beast has eluded capture for years. King Louis sends in a renowned scientist and his Iroquois blood brother, an unconventional team whose combined methods and capabilities may bring the beast down. But the true nature of the beast is not what anyone could have anticipated.","director":"hristophe Gans","poster":"https:\/\/resizing.flixster.com\/0OTBiqG1hCqK9HZMgo0chUX5-fU=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/-XZAfHZM39UwaGJIFWKAE8fS0ak=\/v3\/t\/assets\/p23942_p_v8_ag.jpg"}
{"title":"Captain America: Civil War","year":2016,"Time":146,"rating":89,"genre":"Action","description":"Political pressure mounts to install a system of accountability when the actions of the Avengers lead to collateral damage. The new status quo deeply divides members of the team. Captain America (Chris Evans) believes superheroes should remain free to defend humanity without government interference. Iron Man (Robert Downey Jr.) sharply disagrees and supports oversight. As the debate escalates into an all-out feud, Black Widow (Scarlett Johansson) and Hawkeye (Jeremy Renner) must pick a side.","director":"Anthony Russo","poster":"https:\/\/resizing.flixster.com\/3565LZgEEcWxfGfsOnsB9nhNrlE=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/1nBX_V-Cyl3s_VE5LBBZR0sXvvo=\/ems.cHJkLWVtcy1hc3NldHMvbW92aWVzL2M3NGMwNGE0LTE2MWMtNDIzYS1hMTQyLWY0ZWM0MGU4ZGIxNC53ZWJw"}
{"title":"Captain America: The Winter Soldier","year":2014,"Time":135,"rating":92,"genre":"Action","description":"After the cataclysmic events in New York with his fellow Avengers, Steve Rogers, aka Captain America (Chris Evans), lives in the nation's capital as he tries to adjust to modern times. An attack on a S.H.I.E.L.D. colleague throws Rogers into a web of intrigue that places the whole world at risk. Joining forces with the Black Widow (Scarlett Johansson) and a new ally, the Falcon, Rogers struggles to expose an ever-widening conspiracy, but he and his team soon come up against an unexpected enemy.","director":"Anthony Russo","poster":"https:\/\/resizing.flixster.com\/PH5ePhOSNt0xWp1M7HJfG94tUXU=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/0CcKqiPAlAjfgjKkaVOitCwlYmQ=\/ems.cHJkLWVtcy1hc3NldHMvbW92aWVzLzY4NjQ3NDY3LTNhM2QtNDI2Yi1iM2NjLWJiM2Y4MDQ1NjE0NS5qcGc="}
{"title":"Casino Royale","year":2006,"Time":144,"rating":90,"genre":"Action","description":"After receiving a license to kill, British Secret Service agent James Bond (Daniel Craig) heads to Madagascar, where he uncovers a link to Le Chiffre (Mads Mikkelsen), a man who finances terrorist organizations. Learning that Le Chiffre plans to raise money in a high-stakes poker game, MI6 sends Bond to play against him, gambling that their newest \"007\" operative will topple the man's organization.","director":"Martin Campbell","poster":"https:\/\/resizing.flixster.com\/i16yQMtaSGTl2HKMtVcC2N0jEYM=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/-XZAfHZM39UwaGJIFWKAE8fS0ak=\/v3\/t\/assets\/p159167_p_v8_ac.jpg"}
{"title":"Commando","year":1985,"Time":90,"rating":68,"genre":"Action","description":"Retired Special Forces soldier John Matrix (Arnold Schwarzenegger) lives with daughter Jenny (Alyssa Milano) in isolation, but his privacy is disturbed by former commander Franklin Kirby (James Olson), who warns him that his fellow soldiers are getting killed one by one. After Kirby leaves, Jenny is kidnapped by former Latin American dictator Arius (Dan Hedaya), who wants Matrix to restore him to power. Instead, Matrix sets out to take down the rogue leader and rescue his daughter.","director":"Mark L. Lester","poster":"https:\/\/resizing.flixster.com\/JfP4vmkY3CiCuuq5glHNc5hNdB0=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/-XZAfHZM39UwaGJIFWKAE8fS0ak=\/v3\/t\/assets\/p8739_p_v12_am.jpg"}
{"title":"Crouching Tiger, Hidden Dragon","year":2000,"Time":120,"rating":86,"genre":"Action","description":"In 19th century Qing Dynasty China, a warrior (Chow Yun-Fat) gives his sword, Green Destiny, to his lover (Michelle Yeoh) to deliver to safe keeping, but it is stolen, and the chase is on to find it. The search leads to the House of Yu where the story takes on a whole different level.","director":"Ang Lee","poster":"https:\/\/resizing.flixster.com\/Ia5aau_-R0P169VtZVZ6CBRKkFY=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/-XZAfHZM39UwaGJIFWKAE8fS0ak=\/v3\/t\/assets\/p25570_p_v8_av.jpg"}
{"title":"Die Hard","year":1988,"Time":131,"rating":94,"genre":"Action","description":"New York City policeman John McClane (Bruce Willis) is visiting his estranged wife (Bonnie Bedelia) on Christmas Eve. He joins her at a holiday party in the headquarters of the Japanese-owned business she works for. But the festivities are interrupted by a group of terrorists who take over the exclusive high-rise, and everyone in it. Very soon McClane realizes that there's no one to save the hostages -- but him.","director":"John McTiernan","poster":"https:\/\/media.discordapp.net\/attachments\/894196629291286531\/1173606709395193937\/MV5BZjRlNDUxZjAtOGQ4OC00OTNlLTgxNmQtYTBmMDgwZmNmNjkxXkEyXkFqcGdeQXVyNzkwMjQ5NzM.png?ex=6564916c&is=65521c6c&hm=e3434082631b72150236fa67373c2442ebfe91546813a273b78cffe4c4de3c9c&=&width=398&height=597"}
{"title":"Die Hard 2","year":1990,"Time":124,"rating":70,"genre":"Action","description":"A year after his heroics in L.A, detective John McClane (Bruce Willis) is mixed up in another terrorist plot, this time at Washington Dulles International Airport, where he is waiting for his wife (Bonnie Bedelia). That same night, South American politico and drug profiteer Ramon Esperanza (Franco Nero) is arriving in U.S. custody. McClane takes action when a treasonous ex-colonel (William Sadler) seizes control of the airport, threatening to crash every inbound flight unless Esperanza is freed.","director":"John McTiernan","poster":"https:\/\/media.discordapp.net\/attachments\/894196629291286531\/1173606745415893013\/MV5BMzMzYzk3ZTEtZDg0My00MTY5LWE3ZmQtYzNhYjhjN2RhZGRjL2ltYWdlXkEyXkFqcGdeQXVyNTAyODkwOQ.png?ex=65649174&is=65521c74&hm=20ddb38480dc165477de6c2c714072513803a0e61473be75c7b2be77b046d704&=&width=403&height=597"}
{"title":"Dirty Harry","year":1971,"Time":103,"rating":90,"genre":"Action","description":"Cop Harry Callahan (Clint Eastwood) attempts to track down a psychopathic rooftop killer before a kidnapped girl dies. When he is found Harry abuses the murderer's civil rights putting him back on the streets. Once he is released he hijacks a school bus and Harry must go after him again. The only way to stop this vicious killer is in cold blood.","director":"Don Siegel","poster":"https:\/\/resizing.flixster.com\/Ylu8EpMy3W2fXe2CwDKM7end3I0=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/-XZAfHZM39UwaGJIFWKAE8fS0ak=\/v3\/t\/NowShowing\/18669\/18669_aa.jpg"}
{"title":"Dredd","year":2012,"Time":96,"rating":72,"genre":"Action","description":"Mega City One is a vast, violent metropolis where felons rule the streets. The only law lies with cops called \"judges,\" who act as judge, jury and executioner, and Dredd (Karl Urban) is one of the city's most feared. One day, Dredd is partnered with Cassandra (Olivia Thirlby), a rookie with powerful psychic abilities. A report of a terrible crime sends Dredd and Cassandra to a dangerous area controlled by Ma-Ma (Lena Headey), a drug lord who will stop at nothing to protect her empire.","director":"Pete Travis","poster":"https:\/\/resizing.flixster.com\/KRxRp-8OnpTOB-zL1QYWV-pB6_o=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/-XZAfHZM39UwaGJIFWKAE8fS0ak=\/v3\/t\/assets\/p9128607_p_v8_ac.jpg"}
{"title":"Drive","year":2011,"Time":100,"rating":79,"genre":"Action","description":"Driver is a skilled Hollywood stuntman who moonlights as a getaway driver for criminals. Though he projects an icy exterior, lately he's been warming up to a pretty neighbor named Irene and her young son, Benicio. When Irene's husband gets out of jail, he enlists Driver's help in a million-dollar heist. The job goes horribly wrong, and Driver must risk his life to protect Irene and Benicio from the vengeful masterminds behind the robbery.","director":"Nicolas Winding Refn","poster":"https:\/\/resizing.flixster.com\/O9hLGhrO14vIJyap_V8WMqY3SDo=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/-XZAfHZM39UwaGJIFWKAE8fS0ak=\/v3\/t\/assets\/p8609718_p_v12_ar.jpg"}
{"title":"Edge of Tomorrow","year":2014,"Time":113,"rating":90,"genre":"Action","description":"When Earth falls under attack from invincible aliens, no military unit in the world is able to beat them. Maj. William Cage (Tom Cruise), an officer who has never seen combat, is assigned to a suicide mission. Killed within moments, Cage finds himself thrown into a time loop, in which he relives the same brutal fight -- and his death -- over and over again. However, Cage's fighting skills improve with each encore, bringing him and a comrade (Emily Blunt) ever closer to defeating the aliens.","director":"Doug Liman","poster":"https:\/\/resizing.flixster.com\/5LKtVAEs75FYP3u8ndGeN5lUreI=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/-XZAfHZM39UwaGJIFWKAE8fS0ak=\/v3\/t\/assets\/p9957443_p_v8_aj.jpg"}
{"title":"Enter the Dragon","year":1973,"Time":99,"rating":91,"genre":"Action","description":"Bruce Lee plays a martial-arts expert determined to help capture the narcotics dealer whose gang was responsible for the death of his sister. Lee enters a kung fu competition in an attempt to fight his way to the dealer's headquarters with the help of some friends.","director":"Robert Clouse","poster":"https:\/\/media.discordapp.net\/attachments\/894196629291286531\/1173606847933059143\/MV5BNGZiMTkyNzQtMDdmZi00ZDNkLWE4YTAtZGNlNTIzYzQyMGM2XkEyXkFqcGdeQXVyNjc1NTYyMjg.png?ex=6564918d&is=65521c8d&hm=347b3219410031f81b313af9cdab321757d35c59b6668cfd8882e3b224f90883&=&width=404&height=597"}
{"title":"First Blood","year":1982,"Time":95,"rating":85,"genre":"Action","description":"Vietnam veteran and drifter John J. Rambo (Sylvester Stallone) wanders into a small Washington town in search of an old friend, but is met with intolerance and brutality by the local sheriff, Will Teasle (Brian Dennehy). When Teasle and his deputies restrain and shave Rambo, he flashes back to his time as a prisoner of war and unleashes his fury on the officers. He narrowly escapes the manhunt, but it will take his former commander (Richard Crenna) to save the hunters from the hunted.","director":"Ted Kotcheff","poster":"https:\/\/resizing.flixster.com\/4aFYcwkt_D5dMnHiT_u-NUDFMbY=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/-XZAfHZM39UwaGJIFWKAE8fS0ak=\/v3\/t\/assets\/p6343_p_v8_ar.jpg"}
{"title":"For Your Eyes Only ","year":1981,"Time":127,"rating":64,"genre":"Action","description":"When a British ship is sunk in foreign waters, the world's superpowers begin a feverish race to find its cargo: a nuclear submarine control system. And 007 (Roger Moore) is thrust into one of his most riveting adventures as he rushes to join the search ... and prevent global devastation!","director":"John Glen","poster":"https:\/\/m.media-amazon.com\/images\/M\/MV5BN2RhOWEyM2UtNTYwMC00ZGUxLWFiMzktNTAzYjFjNmZlYzMyXkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_.jpg"}
{"title":"Gladiator","year":2000,"Time":154,"rating":87,"genre":"Action","description":"Commodus (Joaquin Phoenix) takes power and strips rank from Maximus (Russell Crowe), one of the favored generals of his predecessor and father, Emperor Marcus Aurelius, the great stoical philosopher. Maximus is then relegated to fighting to the death in the gladiator arenas.","director":"Ridley  Scott","poster":"https:\/\/resizing.flixster.com\/JX-pzSamkvLD7M5Kt2_uFy8f3bI=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/-XZAfHZM39UwaGJIFWKAE8fS0ak=\/v3\/t\/assets\/p24674_p_v8_ae.jpg"}
{"title":"GoldenEye","year":1995,"Time":130,"rating":83,"genre":"Action","description":"When a powerful satellite system falls into the hands of Alec Trevelyan, AKA Agent 006 (Sean Bean), a former ally-turned-enemy, only James Bond (Pierce Brosnan) can save the world from an awesome space weapon that -- in one short pulse -- could destroy the earth! As Bond(007) squares off against his former compatriot, he also battles Trevelyan's stunning ally, Xenia Onatopp (Famke Janssen), an assassin who uses pleasure as her ultimate weapon.","director":"Martin Campbell","poster":"https:\/\/resizing.flixster.com\/-XZAfHZM39UwaGJIFWKAE8fS0ak=\/v3\/t\/assets\/p17416_v_v10_aa.jpg"}
{"title":"Goldfinger","year":1964,"Time":112,"rating":89,"genre":"Action","description":"Special agent 007 (Sean Connery) comes face to face with one of the most notorious villains of all time, and now he must outwit and outgun the powerful tycoon to prevent him from cashing in on a devious scheme to raid Fort Knox -- and obliterate the world's economy.","director":"Guy Hamilton","poster":"https:\/\/media.discordapp.net\/attachments\/894196629291286531\/1173606926194589726\/goldfinger-poster.png?ex=6564919f&is=65521c9f&hm=620e618b6e7bc036871f2e668d8b88250e81400eb9d427863d339f0633077ff6&=&width=382&height=597"}
{"title":"Hard Boiled","year":1992,"Time":126,"rating":92,"genre":"Action","description":"A cop who loses his partner in a shoot-out with gun smugglers goes on a mission to catch them. In order to get closer to the leaders of the ring he joins forces with an undercover cop who's working as a gangster hitman. They use all means of excessive force to find them.","director":"John Woo","poster":"https:\/\/media.discordapp.net\/attachments\/894196629291286531\/1173607002056966225\/MV5BM2M1MDMzODEtN2MzZC00NDJmLWJhMTMtNGUxYjM1ZmJlY2RkXkEyXkFqcGdeQXVyMjUzOTY1NTc.png?ex=656491b1&is=65521cb1&hm=74c31a5dce163a060a53f255f23a83c5e6b970112938bc3001a71b3ea7ddccc1&=&width=407&height=597"}
{"title":"Heat ","year":1995,"Time":170,"rating":95,"genre":"Action","description":"Master criminal Neil McCauley (Robert De Niro) is trying to control the rogue actions of one of his men, while also planning one last big heist before retiring. Meanwhile, Lieutenant Hanna (Al Pacino) attempts to track down McCauley as he deals with the chaos in his own life, including the infidelity of his wife (Diane Venora) and the mental health of his stepdaughter (Natalie Portman). McCauley and Hanna discover a mutual respect, even as they try to thwart each other's plans.","director":"Michael Mann","poster":" https:\/\/resizing.flixster.com\/66UsMKklbSqzjW5VmllI6MoDhtM=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/-XZAfHZM39UwaGJIFWKAE8fS0ak=\/v3\/t\/assets\/p17455_p_v8_ae.jpg"}
{"title":"Hero","year":2002,"Time":93,"rating":87,"genre":"Action","description":"In this visually arresting martial arts epic set in ancient China, an unnamed fighter (Jet Li) is being honored for defeating three of the king's most dangerous enemies. When Nameless recounts his battles with the assassins -- Broken Sword (Tony Leung Chiu Wai), Flying Snow (Maggie Cheung Man-yuk) and Moon (Zhang Ziyi) -- the king begins to question some of the details. As Nameless goes on, the king challenges the tales, interjecting his own take on these perhaps suspect version of events.","director":"Yimou Zhang","poster":"https:\/\/media.discordapp.net\/attachments\/894196629291286531\/1174609556932927578\/p34738_p_v8_ae.png?ex=65683765&is=6555c265&hm=6d3e70f6c9991453663e448e40351c4f05c3869a8b1146eb8fd3af1dd5f3d48b&=&width=412&height=610"}
{"title":"Inception","year":2010,"Time":148,"rating":91,"genre":"Action","description":"Dom Cobb (Leonardo DiCaprio) is a thief with the rare ability to enter people's dreams and steal their secrets from their subconscious. His skill has made him a hot commodity in the world of corporate espionage but has also cost him everything he loves. Cobb gets a chance at redemption when he is offered a seemingly impossible task: Plant an idea in someone's mind. If he succeeds, it will be the perfect crime, but a dangerous enemy anticipates Cobb's every move.","director":"Christopher Nolan","poster":"https:\/\/resizing.flixster.com\/DiuK_sbZZJWia0hksraIAFZDMj0=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/-XZAfHZM39UwaGJIFWKAE8fS0ak=\/v3\/t\/assets\/p7825626_p_v8_af.jpg"}
{"title":"Indiana Jone and the Last Crusade","year":1989,"Time":127,"rating":94,"genre":"Action","description":"An art collector appeals to Jones to embark on a search for the Holy Grail. He learns that another archaeologist has disappeared while searching for the precious goblet, and the missing man is his own father, Dr. Henry Jones. The artifact is much harder to find than they expected, and its powers are too much for those impure in heart.","director":"Steven Spielberg","poster":"https:\/\/resizing.flixster.com\/WEZg5fTvuiQZk7lonL9wn4KmmYQ=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/hPpZb_vLUpR41867xgSnDiq-nJ0=\/ems.cHJkLWVtcy1hc3NldHMvbW92aWVzLzBlYTk5ZTBiLTM5OGUtNDk2Yi1iMGNhLTFhOGVhNTA2NTY1MS5qcGc="}
{"title":"Indiana Jones and the Temple of Doom","year":1984,"Time":118,"rating":82,"genre":"Action","description":"The second of the Lucas\/Spielberg Indiana Jones epics is set a year or so before the events in Raiders of the Lost Ark. Indy needs to retrieve a precious gem and several kidnapped young boys on behalf of a remote East Indian village. This time he teams up with a night club singer and a 12-year old boy.","director":"Steven Spielberg","poster":"https:\/\/media.discordapp.net\/attachments\/894196629291286531\/1173607073905381428\/MV5BYzgzMTIzNzctNmNiZC00ZDYyLWJjNzktMmQ2MDM2ZDkwZGVhXkEyXkFqcGdeQXVyMjM4MzQ4OTQ.png?ex=656491c2&is=65521cc2&hm=2b7c322fb53b05e8f54249b01799407f7fcb779aa11e327bc933d2165a3a104d&=&width=401&height=597"}
{"title":"Ip Man","year":2008,"Time":106,"rating":93,"genre":"Action","description":"The life story of Yip Man, the first person to teach the Chinese martial art of Wing Chun.","director":"Wilson Yip","poster":"https:\/\/resizing.flixster.com\/saZzWuv5ID3FohsQxgTlE_FUTd0=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/-XZAfHZM39UwaGJIFWKAE8fS0ak=\/v3\/t\/assets\/p3586588_p_v8_ad.jpg"}
{"title":"Iron Man","year":2008,"Time":126,"rating":91,"genre":"Action","description":"A billionaire industrialist and genius inventor, Tony Stark (Robert Downey Jr.), is conducting weapons tests overseas, but terrorists kidnap him to force him to build a devastating weapon. Instead, he builds an armored suit and upends his captors. Returning to America, Stark refines the suit and uses it to combat crime and terrorism.","director":"Jon Favreau","poster":"https:\/\/resizing.flixster.com\/ihlpiLqY91oIUjw7KCagfqIBd-4=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/-XZAfHZM39UwaGJIFWKAE8fS0ak=\/v3\/t\/assets\/p170620_p_v8_az.jpg"}
{"title":"John Wick: Chapter 1","year":2014,"Time":101,"rating":81,"genre":"Action","description":"Legendary assassin John Wick (Keanu Reeves) retired from his violent career after marrying the love of his life. Her sudden death leaves John in deep mourning. When sadistic mobster Iosef Tarasov (Alfie Allen) and his thugs steal John's prized car and kill the puppy that was a last gift from his wife, John unleashes the remorseless killing machine within and seeks vengeance. Meanwhile, Iosef's father (Michael Nyqvist) -- John's former colleague -- puts a huge bounty on John's head.","director":"Chad Stahelski","poster":"https:\/\/resizing.flixster.com\/hhIYfTHqIDvKS1zRonipZLXJw1U=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/YGhqvw5DEj6kmov8fbvF5P9QWRo=\/ems.cHJkLWVtcy1hc3NldHMvbW92aWVzLzg2OGYzN2Q1LWFhYjUtNDk2Yy04N2Q0LTE5YWEyNDQ4Yjg3ZC5qcGc="}
{"title":"John Wick: Chapter 2","year":2017,"Time":122,"rating":85,"genre":"Action","description":"Retired super-assassin John Wick's plans to resume a quiet civilian life are cut short when Italian gangster Santino D'Antonio shows up on his doorstep with a gold marker, compelling him to repay past favors. Ordered by Winston, kingpin of secret assassin society The Continental, to respect the organization's ancient code, Wick reluctantly accepts the assignment to travel to Rome to take out D'Antonio's sister, the ruthless capo atop the Italian Camorra crime syndicate.","director":"Chad Stahelski","poster":"https:\/\/resizing.flixster.com\/UkwvONRfkZXsxD2iwrr29m2h9Nk=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/t03J-N7iMiWdgqbkRNHNArjDD44=\/ems.cHJkLWVtcy1hc3NldHMvbW92aWVzLzcxY2M3ZWE3LTc3Y2ItNDExMS1hNzhkLWJhYTljMzZiZmVkNC53ZWJw"}
{"title":"John Wick: Chapter 3 Parabellum","year":2019,"Time":131,"rating":86,"genre":"Action","description":"After gunning down a member of the High Table -- the shadowy international assassin's guild -- legendary hit man John Wick finds himself stripped of the organization's protective services. Now stuck with a $14 million bounty on his head, Wick must fight his way through the streets of New York as he becomes the target of the world's most ruthless killers.","director":"Chad Stahelski","poster":"https:\/\/resizing.flixster.com\/58xfF7YBOxMtbXP87zaWfjZ3fsk=\/fit-in\/80x126\/v2\/https:\/\/resizing.flixster.com\/W4TpAGQ8fGpOiZtkt8RXHW0ZvmE=\/ems.cHJkLWVtcy1hc3NldHMvbW92aWVzL2U2NGRkMGIzLThiOTgtNDE1Mi1iZGYyLWQ4M2Y4OTg3ZDBkMC53ZWJw"}
{"title":"Kill Bill: Vol. 1","year":2003,"Time":110,"rating":81,"genre":"Action","description":"A former assassin, known simply as The Bride (Uma Thurman), wakes from a coma four years after her jealous ex-lover Bill (David Carradine) attempts to murder her on her wedding day. Fueled by an insatiable desire for revenge, she vows to get even with every person who contributed to the loss of her unborn child, her entire wedding party, and four years of her life. After devising a hit list, The Bride sets off on her quest, enduring unspeakable injury and unscrupulous enemies.","director":"Quentin Tarantino","poster":"https:\/\/resizing.flixster.com\/b_axIdXiKC1CJS26JaeRz2ty1-s=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/-XZAfHZM39UwaGJIFWKAE8fS0ak=\/v3\/t\/assets\/p32988_p_v8_aa.jpg"}
{"title":"Kill Bill: Vol. 2","year":2004,"Time":137,"rating":89,"genre":"Action","description":"The Bride (Uma Thurman) picks up where she left off in volume one with her quest to finish the hit list she has composed of all of the people who have wronged her, including ex-boyfriend Bill (David Carradine), who tried to have her killed four years ago during her wedding to another man. Leaving several dead in her wake, she eventually tracks down Bill in Mexico. Using skills she has learned during her assassin career, she attempts to finish what she set out to do in the first place.","director":"Quentin Tarantino","poster":"https:\/\/resizing.flixster.com\/S4wBu2hU5wveBBN6ylj3JxVB0KU=\/fit-in\/80x126\/v2\/https:\/\/resizing.flixster.com\/-XZAfHZM39UwaGJIFWKAE8fS0ak=\/v3\/t\/assets\/p32989_p_v12_ar.jpg"}
{"title":"Kingsman: The Secret Service","year":2014,"Time":129,"rating":84,"genre":"Action","description":"Gary \"Eggsy\" Unwin (Taron Egerton), whose late father secretly worked for a spy organization, lives in a South London housing estate and seems headed for a life behind bars. However, dapper agent Harry Hart (Colin Firth) recognizes potential in the youth and recruits him to be a trainee in the secret service. Meanwhile, villainous Richmond Valentine (Samuel L. Jackson) launches a diabolical plan to solve the problem of climate change via a worldwide killing spree.","director":"Matthew Vaughn","poster":"https:\/\/resizing.flixster.com\/A9a9-9woCM7HbfRdVhri1vDT5RM=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/-XZAfHZM39UwaGJIFWKAE8fS0ak=\/v3\/t\/assets\/p10672282_p_v8_ad.jpg"}
{"title":"Kung Fu Hustle","year":2004,"Time":99,"rating":89,"genre":"Action","description":"When the hapless Sing and his dim-witted pal Bone try to scam the residents of Pig Sty Alley into thinking they're members of the dreaded Axe Gang, the real gangsters descend on this Shanghai slum to restore their fearsome reputation. What gang leader Brother Sum doesn't know is that three legendary retired kung fu masters live anonymously in this decrepit neighborhood and don't take kindly to interlopers.","director":"Stephen Chow","poster":"https:\/\/resizing.flixster.com\/AVl2TDyc4QIMxY9IDMju5wNnvEk=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/-XZAfHZM39UwaGJIFWKAE8fS0ak=\/v3\/t\/assets\/p35470_p_v8_aj.jpg"}
{"title":"Lethal Weapon","year":1987,"Time":109,"rating":86,"genre":"Action","description":"Following the death of his wife, Los Angeles police detective Martin Riggs (Mel Gibson) becomes reckless and suicidal. When he is reassigned and partnered with Roger Murtaugh (Danny Glover), Riggs immediately clashes with the older officer. Together they uncover a massive drug-trafficking ring. As they encounter increasingly dangerous situations, Riggs and Murtaugh begin to form a bond. Riggs' volatile behavior might just help them apprehend the criminals -- if it doesn't kill them both first.","director":"Richard Donner","poster":"https:\/\/resizing.flixster.com\/M6PYm9EkNyFLz3ATY-P7OIgOlag=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/-XZAfHZM39UwaGJIFWKAE8fS0ak=\/v3\/t\/assets\/p9831_p_v8_at.jpg"}
{"title":"Logan","year":2017,"Time":137,"rating":90,"genre":"Action","description":"In the near future, a weary Logan (Hugh Jackman) cares for an ailing Professor X (Patrick Stewart) at a remote outpost on the Mexican border. His plan to hide from the outside world gets upended when he meets a young mutant (Dafne Keen) who is very much like him. Logan must now protect the girl and battle the dark forces that want to capture her.","director":"James Mangold","poster":"https:\/\/resizing.flixster.com\/ebEHNopwMNZ7SR78LoAuwzCNxBA=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/51dPxdHRE4zztJs60xLy9RBKyro=\/ems.cHJkLWVtcy1hc3NldHMvbW92aWVzLzU0MTMxZTVlLWRmZGYtNDk5Ni1hYjc0LWJkZGM4MGMxMDkyNC53ZWJw"}
{"title":"Mad Max: Fury Road","year":2015,"Time":120,"rating":86,"genre":"Action","description":"Years after the collapse of civilization, the tyrannical Immortan Joe enslaves apocalypse survivors inside the desert fortress the Citadel. When the warrior Imperator Furiosa (Charlize Theron) leads the despot's five wives in a daring escape, she forges an alliance with Max Rockatansky (Tom Hardy), a loner and former captive. Fortified in the massive, armored truck the War Rig, they try to outrun the ruthless warlord and his henchmen in a deadly high-speed chase through the Wasteland.","director":"George Miller","poster":"https:\/\/resizing.flixster.com\/5_I-_RHtHmyt_sLVMKfcCzXzyMk=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/-XZAfHZM39UwaGJIFWKAE8fS0ak=\/v3\/t\/assets\/p10854488_p_v8_ao.jpg"}
{"title":"Minority Report","year":2002,"Time":144,"rating":80,"genre":"Action","description":"Based on a story by famed science fiction writer Philip K. Dick, \"Minority Report\" is an action-detective thriller set in Washington D.C. in 2054, where police utilize a psychic technology to arrest and convict murderers before they commit their crime. Tom Cruise plays the head of this Precrime unit and is himself accused of the future murder of a man he hasn't even met.","director":"Steven Spielberg","poster":"https:\/\/resizing.flixster.com\/rzIhQDhypa616sDgDYpTsV22Erw=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/-XZAfHZM39UwaGJIFWKAE8fS0ak=\/v3\/t\/assets\/p29122_p_v8_aa.jpg"}
{"title":"Mission Impossible: Fallout","year":2018,"Time":147,"rating":88,"genre":"Action","description":"Ethan Hunt and the IMF team join forces with CIA assassin August Walker to prevent a disaster of epic proportions. Arms dealer John Lark and a group of terrorists known as the Apostles plan to use three plutonium cores for a simultaneous nuclear attack on the Vatican, Jerusalem and Mecca, Saudi Arabia. When the weapons go missing, Ethan and his crew find themselves in a desperate race against time to prevent them from falling into the wrong hands.","director":"Christopher McQuarrie","poster":"https:\/\/resizing.flixster.com\/klR608is7Xa6SHRr-b-msHSIYk0=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/-XZAfHZM39UwaGJIFWKAE8fS0ak=\/v3\/t\/NowShowing\/168920\/168920_ac.jpg"}
{"title":"Mission Impossible: Ghost Protocol ","year":2011,"Time":133,"rating":76,"genre":"Action","description":"Blamed for a terrorist attack on the Kremlin, Ethan Hunt (Tom Cruise) and the entire IMF agency are disavowed by the U.S. government, while the president initiates the Ghost Protocol. Forced to go \"off the grid\" -- left without resources or backup -- Hunt must somehow clear the agency's name and prevent another attack. Complicating matters even more, Ethan must undertake the impossible mission with a group of fellow IMF fugitives whose actual motives are suspect.","director":"Brad Bird","poster":"https:\/\/resizing.flixster.com\/NnhwAX8uZ6jseu_QgZgOIeh4S-o=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/lnauAR3104r_Iaj1P9PKNZHiBjs=\/ems.cHJkLWVtcy1hc3NldHMvbW92aWVzLzU2YTgwMjY0LTMyMjMtNDViZi1iOGZiLTQ5ZGYwZDVjNDAxMy5qcGc="}
{"title":"Mission Impossible: Rogue Nation","year":2015,"Time":131,"rating":87,"genre":"Action","description":"With the IMF now disbanded and Ethan Hunt (Tom Cruise) out in the cold, a new threat -- called the Syndicate -- soon emerges. The Syndicate is a network of highly skilled operatives who are dedicated to establishing a new world order via an escalating series of terrorist attacks. Faced with what may be the most impossible mission yet, Ethan gathers his team and joins forces with Ilsa Faust (Rebecca Ferguson), a disavowed British agent who may or may not be a member of this deadly rogue nation.","director":"Christopher McQuarrie","poster":"https:\/\/resizing.flixster.com\/p2KUGZLQFQ0Se1eknyITTtBxias=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/KFFYzJYFNrgxs2Y0VhC2ZLnVLNM=\/ems.cHJkLWVtcy1hc3NldHMvbW92aWVzLzI1ZjUxNDJlLTQ1M2YtNDQyYi04NWEyLWNjN2M4YzMxM2JjOC53ZWJw"}
{"title":"Moonraker","year":1979,"Time":126,"rating":43,"genre":"Action","description":"Agent 007 (Roger Moore) blasts into orbit in this action-packed adventure that takes him to Venice, Rio De Janeiro and outer space. When Bond investigates the hijacking of an American space shuttle, he and beautiful CIA agent Holly Goodhead (Lois Chiles) are soon locked in a life-or-death struggle against Hugo Drax (Michael Lonsdale), a power-mad industrialist whose horrific scheme may destroy all human life on earth!","director":"Lewis Gilbert","poster":"https:\/\/resizing.flixster.com\/-XZAfHZM39UwaGJIFWKAE8fS0ak=\/v3\/t\/assets\/p7270_p_v8_ah.jpg"}
{"title":"Mr. & Mrs. Smith","year":2005,"Time":120,"rating":58,"genre":"Action","description":"John (Brad Pitt) and Jane Smith (Angelina Jolie), a couple in a stagnating marriage, live a deceptively mundane existence. However, each has been hiding a secret from the other: they are assassins working for adversarial agencies. When they are both assigned to kill the same target, Benjamin Danz (Adam Brody), the truth comes to the surface. Finally free from their cover stories, they discover that they have been assigned to kill each other, sparking a series of explosive attacks.","director":"Doug Liman","poster":"https:\/\/resizing.flixster.com\/6MSC2PMU59XcM4tJ4ic50Bdbr14=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/-XZAfHZM39UwaGJIFWKAE8fS0ak=\/v3\/t\/assets\/p35901_p_v8_aa.jpg"}
{"title":"National Treaser","year":2004,"Time":130,"rating":76,"genre":"Action","description":"Historian and code-breaker Ben Gates (Nicolas Cage) has been searching his whole life for a rumored treasure dating back to the creation of the United States. Joining an expedition led by fellow treasure hunter Ian Howe (Sean Bean), Gates finds an ice-locked Colonial ship in the Arctic Circle that contains a clue linking the treasure to the Declaration of Independence. But when Howe betrays him, Gates has to race to get to the document ahead of his so-called colleague.","director":"Jon Turteltaub","poster":"https:\/\/media.discordapp.net\/attachments\/894196629291286531\/1174610357348749323\/MV5BMTY3NTc4OTYxMF5BMl5BanBnXkFtZTcwMjk5NzUyMw.png?ex=65683824&is=6555c324&hm=f04892885858e1639d353f256e1c8e27a1a45bf7fc1dad204809a91cd8900017&=&width=720&height=1066"}
{"title":"Nobody","year":2021,"Time":92,"rating":94,"genre":"Action","description":"Emmy winner Bob Odenkirk (Better Call Saul, The Post, Nebraska) stars as Hutch Mansell, an underestimated and overlooked dad and husband, taking life's indignities on the chin and never pushing back. A nobody. When two thieves break into his suburban home one night, Hutch declines to defend himself or his family, hoping to prevent serious violence. His teenage son, Blake (Gage Munroe, The Shack), is disappointed in him and his wife, Becca (Connie Nielsen, Wonder Woman), seems to pull only further away. The aftermath of the incident strikes a match to Hutch's long-simmering rage, triggering dormant instincts and propelling him on a brutal path that will surface dark secrets and lethal skills. In a barrage of fists, gunfire and squealing tires, Hutch must save his family from a dangerous adversary (famed Russian actor Aleksey Serebryakov, Amazon's McMafia)--and ensure that he will never be underestimated as a nobody again.","director":"Ilya Naishuller","poster":"https:\/\/resizing.flixster.com\/oVMjqxHJe-YVStgOEjj5hWdf4xA=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/-XZAfHZM39UwaGJIFWKAE8fS0ak=\/v3\/t\/assets\/p17851008_p_v12_ah.jpg"}
{"title":"No Time to Die","year":2021,"Time":163,"rating":88,"genre":"Action","description":"In No Time To Die, Bond (007) has left active service and is enjoying a tranquil life in Jamaica. His peace is short-lived when his old friend Felix Leiter from the CIA turns up asking for help. The mission to rescue a kidnapped scientist turns out to be far more treacherous than expected, leading Bond onto the trail of a mysterious villain armed with dangerous new technology.","director":"Cary Joji Fukunaga","poster":"https:\/\/m.media-amazon.com\/images\/M\/MV5BYWQ2NzQ1NjktMzNkNS00MGY1LTgwMmMtYTllYTI5YzNmMmE0XkEyXkFqcGdeQXVyMjM4NTM5NDY@._V1_.jpg"}
{"title":"Octopussy","year":1983,"Time":131,"rating":47,"genre":"Action","description":"James Bond (Roger Moore) may have met his match in Octopussy (Maud Adams), an entrancing beauty involved in a devastating military plot to destroy détente. From the palaces of India to a speeding circus train in Germany and a mid-air battle on the wing of a high-flying jet, only Agent 007 can stop the nightmarish scheme!","director":"John Glen","poster":"https:\/\/m.media-amazon.com\/images\/M\/MV5BMjI2MDE0NjE1NV5BMl5BanBnXkFtZTcwNjYyMzY0NA@@._V1_.jpg"}
{"title":"Oldboy","year":2003,"Time":118,"rating":94,"genre":"Action","description":"Dae-Su is an obnoxious drunk bailed from the police station yet again by a friend. However, he's abducted from the street and wakes up in a cell, where he remains for the next 15 years, drugged unconscious when human contact is unavoidable, otherwise with only the television as company. And then, suddenly released, he is invited to track down his jailor with a denouement that is simply stunning.","director":"Park Chan-wook","poster":"https:\/\/resizing.flixster.com\/Gm7UqV-zb1avhyh5MwSjfXCMoHU=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/A4O8aEoaCjZEfnOEFvH8nUmxTtI=\/ems.cHJkLWVtcy1hc3NldHMvbW92aWVzLzZjMjAzODE0LWQ3YTItNDg0NC1iMTY5LTIzOGJmZDM0ZTZjOC5qcGc="}
{"title":"Ong-Bak: The Thai Warrior","year":2003,"Time":107,"rating":84,"genre":"Action","description":"In Thailand, the impoverished village of Ban Nong Pradu has its most precious Buddha statue stolen from the temple. Luckily the small town also has a very skilled fighter in the form of Ting (Tony Jaa), who sets out on a quest to recover the cherished figure. His journey leads him to Bangkok, where he must wrangle the statue from Don (Wannakit Sirioput), a volatile drug dealer. Meanwhile, the village is suffering a severe drought and needs the Buddha to restore vitality.","director":"Prachya Pinkaew","poster":"https:\/\/resizing.flixster.com\/CuJeMgUU2xU_Cp8EtIyKbu9TMlI=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/-XZAfHZM39UwaGJIFWKAE8fS0ak=\/v3\/t\/assets\/p35693_p_v8_aa.jpg"}
{"title":"On Her Majesty's Secret Service","year":1969,"Time":140,"rating":64,"genre":"Action","description":"Agent 007 (George Lazenby) and the adventurous Tracy Di Vicenzo (Diana Rigg) join forces to battle the evil SPECTRE organization in the treacherous Swiss Alps. But the group's powerful leader, Ernst Stavro Blofeld (Telly Savalas), is launching his most calamitous scheme yet: a germ warfare plot that could kill millions!","director":"Peter Hunt","poster":"https:\/\/www.themoviedb.org\/t\/p\/w500\/yVzJLLhBwuWJBR9BYEMurShu2WT.jpg"}
{"title":"Police ","year":1985,"Time":89,"rating":88,"genre":"Action","description":"A kung-fu policeman (Jackie Chan) must protect a female witness (Brigitte Lin) from a Hong Kong drug lord for whom she used to work.","director":"Chen Chi-Hwa","poster":"https:\/\/resizing.flixster.com\/cVIU0mG7pbLf3zbpN2dJ_zmaisU=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/-XZAfHZM39UwaGJIFWKAE8fS0ak=\/v3\/t\/assets\/p9085_p_v8_ad.jpg"}
{"title":"Quantum of Solace","year":2008,"Time":105,"rating":58,"genre":"Action","description":"Following the death of Vesper Lynd, James Bond (Daniel Craig) makes his next mission personal. The hunt for those who blackmailed his lover leads him to ruthless businessman Dominic Greene (Mathieu Amalric), a key player in the organization which coerced Vesper. Bond(007) learns that Greene is plotting to gain total control of a vital natural resource, and he must navigate a minefield of danger and treachery to foil the plan.","director":"Marc Forster","poster":"https:\/\/m.media-amazon.com\/images\/M\/MV5BMzhjYzlmYjQtYmU0Yy00NjNkLWFmOTQtZjQxZWU4NjY1Y2M4XkEyXkFqcGdeQXVyMjUzOTY1NTc@._V1_FMjpg_UX1000_.jpg"}
{"title":"Raiders of the lost ark","year":1981,"Time":115,"rating":96,"genre":"Action","description":"Dr. Indiana Jones, a renowned archeologist and expert in the occult, is hired by the U.S. Government to find the ark of the covenant, which is believed to still hold the Ten Commandments. Unfortunately, Hitler's agents are also after the ark. Indy and his ex-flame Marion escape from various close scrapes in a quest that takes them from Nepal to Cairo","director":"Steven Spielberg","poster":"https:\/\/media.discordapp.net\/attachments\/894196629291286531\/1173607160622620802\/MV5BNTU2ODkyY2MtMjU1NC00NjE1LWEzYjgtMWQ3MzRhMTE0NDc0XkEyXkFqcGdeQXVyMjM4MzQ4OTQ.png?ex=656491d7&is=65521cd7&hm=e541be101a1b6743a3d85edf16d40bbb28b04c0d0627d7f8cbb7aea2b520f0a8&=&width=406&height=597"}
{"title":"Red Cliff","year":2008,"Time":148,"rating":78,"genre":"Action","description":"In ancient China, the emperor of the Han Dynasty allows General Cao Cao (Fengyi Zhang) to declare war against the rebellious southern provinces, with the intention of unifying the entire country. Cao's large army quickly advances, killing civilians and soldiers alike. To resist Cao, the southern warlords form an alliance led by Viceroy Zhou Yu (Tony Leung). Outnumbered, Zhou relies upon elaborate formations and unorthodox strategies to fight against Cao's overwhelming forces.","director":"John Woo","poster":"https:\/\/resizing.flixster.com\/M45Cxiw_mmNmSl6wbF-YDuO76HM=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/-XZAfHZM39UwaGJIFWKAE8fS0ak=\/v3\/t\/assets\/p3576770_p_v8_aa.jpg"}
{"title":"Robocop","year":1987,"Time":102,"rating":84,"genre":"Action","description":"In a violent, near-apocalyptic Detroit, evil corporation Omni Consumer Products wins a contract from the city government to privatize the police force. To test their crime-eradicating cyborgs, the company leads street cop Alex Murphy (Peter Weller) into an armed confrontation with crime lord Boddicker (Kurtwood Smith) so they can use his body to support their untested RoboCop prototype. But when RoboCop learns of the company's nefarious plans, he turns on his maste","director":"Paul Verhoeven","poster":"https:\/\/resizing.flixster.com\/5yklqvnfc-Rdjw5qOCM3SJD-0bI=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/-XZAfHZM39UwaGJIFWKAE8fS0ak=\/v3\/t\/assets\/p10144_p_v8_av.jpg"}
{"title":"Rush Hour","year":1998,"Time":98,"rating":78,"genre":"Action","description":"When a Chinese diplomat's daughter is kidnapped in Los Angeles, he calls in Hong Kong Detective Inspector Lee (Jackie Chan) to assist the FBI with the case. But the FBI doesn't want anything to do with Lee, and they dump him off on the LAPD, who assign wisecracking Detective James Carter (Chris Tucker) to watch over him. Although Lee and Carter can't stand each other, they choose to work together to solve the case on their own when they figure out they've been ditched by both the FBI and police.","director":"Brett Ratner","poster":"https:\/\/resizing.flixster.com\/pT71JfVIlRemOb9Xa85Eup7VLrI=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/-XZAfHZM39UwaGJIFWKAE8fS0ak=\/v3\/t\/assets\/p21702_p_v8_ae.jpg"}
{"title":"Saving Private Ryan","year":1998,"Time":169,"rating":95,"genre":"Action","description":"Captain John Miller (Tom Hanks) takes his men behind enemy lines to find Private James Ryan, whose three brothers have been killed in combat. Surrounded by the brutal realties of war, while searching for Ryan, each man embarks upon a personal journey and discovers their own strength to triumph over an uncertain future with honor, decency and courage.","director":"Steven Spielberg","poster":"https:\/\/resizing.flixster.com\/XVNAznyRbCLqsckGZpqtGCwAHcs=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/e4XDrbw7Fd7VYePV7cxB8sQV3eA=\/ems.cHJkLWVtcy1hc3NldHMvbW92aWVzLzc1MDczNGJlLWNjN2EtNGIxMS1iOWM5LWJjYTUwODk4MzA5Yy53ZWJw"}
{"title":"SkyFall","year":2012,"Time":143,"rating":86,"genre":"Action","description":"When James Bond's (Daniel Craig) latest assignment goes terribly wrong, it leads to a calamitous turn of events: Undercover agents around the world are exposed, and MI6 is attacked, forcing M (Judi Dench) to relocate the agency. With MI6 now compromised inside and out, M turns to the one man she can trust: Bond. Aided only by a field agent (Naomie Harris), Bond takes to the shadows and follows a trail to Silva (Javier Bardem), a man from M's past who wants to settle an old score.","director":"Sam Mendes","poster":"https:\/\/resizing.flixster.com\/vhP4mo77CSMUxv-DLJLSaGpHjGA=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/-XZAfHZM39UwaGJIFWKAE8fS0ak=\/v3\/t\/assets\/p8919177_p_v8_ae.jpg"}
{"title":"Spectre","year":2015,"Time":148,"rating":61,"genre":"Action","description":"A cryptic message from the past leads James Bond (Daniel Craig) to Mexico City and Rome, where he meets the beautiful widow (Monica Bellucci) of an infamous criminal. After infiltrating a secret meeting, 007 uncovers the existence of the sinister organization SPECTRE. Needing the help of the daughter of an old nemesis, he embarks on a mission to find her. As Bond ventures toward the heart of SPECTRE, he discovers a chilling connection between himself and the enemy (Christoph Waltz) he seeks.","director":"Sam Mendes","poster":"https:\/\/m.media-amazon.com\/images\/M\/MV5BOWQ1MDE1NzgtNTQ4OC00ZjliLTllZDAtN2IyOTVmMTc5YjUxXkEyXkFqcGdeQXVyNzkwMjQ5NzM@._V1_FMjpg_UX1000_.jpg"}
{"title":"Speed ","year":1994,"Time":115,"rating":76,"genre":"Action","description":"Los Angeles police officer Jack (Keanu Reeves) angers retired bomb squad member Howard Payne (Dennis Hopper) by foiling his attempt at taking hostages. In revenge, Payne arms a bus with a bomb that will explode if it drops below 50 miles per hour. With the help of spunky passenger Annie (Sandra Bullock), Jack and his partner Harry (Jeff Daniels) try to save the people on the bus before the bomb goes off, while also trying to figure out how Payne is monitoring them.","director":"Jan de Bont","poster":"https:\/\/resizing.flixster.com\/1opj7202iwJlVKsfZ1aomFEm7Qk=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/-XZAfHZM39UwaGJIFWKAE8fS0ak=\/v3\/t\/NowShowing\/3410\/3410_aa.jpg"}
{"title":"Spider man 2","year":2004,"Time":122,"rating":82,"genre":"Action","description":"When a failed nuclear fusion experiment results in an explosion that kills his wife, Dr. Otto Octavius (Alfred Molina) is transformed into Dr. Octopus, a cyborg with deadly metal tentacles. Doc Ock blames Spider-Man (Tobey Maguire) for the accident and seeks revenge. Meanwhile, Spidey's alter ego, Peter Parker, faces fading powers and self-doubt. Complicating matters are his best friend's (James Franco) hatred for Spider-Man and his true love's (Kirsten Dunst) sudden engagement to another man.","director":"Sam Raimi","poster":"https:\/\/resizing.flixster.com\/IUM0eq1xZ6TLBCbd5KyS9XSiaZI=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/-XZAfHZM39UwaGJIFWKAE8fS0ak=\/v3\/t\/assets\/p34442_p_v10_aq.jpg"}
{"title":"Supercop","year":1992,"Time":91,"rating":75,"genre":"Action","description":"To infiltrate a drug cartel, police Inspector Chan Ka Kui (Jackie Chan) goes undercover in a Chinese prison. There, he earns the trust of Panther (Yuen Wah), a cartel member, by breaking him out of prison. With the help of another undercover agent (Michelle Yeaoh), they travel to Hong Kong and join up with Panther's gang. Ka Kui is accepted by the gang's leader (Ken Tsang), but his operation is jeopardized when Ka Kui's girlfriend (Maggie Cheung) accidentally reveals his true identity.","director":"Stanley Tong","poster":"https:\/\/resizing.flixster.com\/ujf_-cEI5q50N05S5ToOGlPhFxg=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/-XZAfHZM39UwaGJIFWKAE8fS0ak=\/v3\/t\/assets\/p18287_p_v8_aa.jpg"}
{"title":"Terminator 2: Judgment Day","year":1991,"Time":136,"rating":95,"genre":"Action","description":"In this sequel set eleven years after \"The Terminator,\" young John Connor (Edward Furlong), the key to civilization's victory over a future robot uprising, is the target of the shape-shifting T-1000 (Robert Patrick), a Terminator sent from the future to kill him. Another Terminator, the revamped T-800 (Arnold Schwarzenegger), has been sent back to protect the boy. As John and his mother (Linda Hamilton) go on the run with the T-800, the boy forms an unexpected bond with the robot.","director":"James Cameron","poster":"https:\/\/resizing.flixster.com\/fmN-hvG5Ziivmkl-RG36E_juLz4=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/-XZAfHZM39UwaGJIFWKAE8fS0ak=\/v3\/t\/assets\/p13308_p_v8_ag.jpg"}
{"title":"The Bourne Identity","year":2002,"Time":113,"rating":93,"genre":"Action","description":"The story of a man (Matt Damon), salvaged, near death, from the ocean by an Italian fishing boat. When he recuperates, the man suffers from total amnesia, without identity or background... except for a range of extraordinary talents in fighting, linguistic skills and self-defense that speak of a dangerous past. He sets out on a desperate search-assisted by the initially rebellious Marie (Franka Potente) - to discover who he really is, and why he's being lethally pursued by assassins.","director":"Doug Liman","poster":"https:\/\/resizing.flixster.com\/ZPHXTQCx-WNA2Iw0Nen5yIHbLsg=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/-XZAfHZM39UwaGJIFWKAE8fS0ak=\/v3\/t\/assets\/p28900_p_v8_ar.jpg"}
{"title":"The Bourne Ultimatum","year":2007,"Time":115,"rating":91,"genre":"Action","description":"Jason Bourne (Matt Damon) continues his international quest to uncover his true identity. From Russia to Europe to northern Africa to the United States, he must stay one step ahead of those who would capture or kill him before he has a chance to discover the truth.","director":"Paul Greengrass","poster":"https:\/\/resizing.flixster.com\/u2zdbveIQ9PXlyCGOp5Wpb4d_U8=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/-XZAfHZM39UwaGJIFWKAE8fS0ak=\/v3\/t\/assets\/p166270_p_v8_ai.jpg"}
{"title":"The Chinese Connection","year":1972,"Time":107,"rating":83,"genre":"Action","description":"Chen Zhen (Bruce Lee) has left his homeland of China and relocated to stay with family in Thailand. Chen, who swore to his mother that he would avoid violence in his new life and even wears a necklace to remind himself of this oath, is tested when he confronts trouble at his job. When he finds out the factory he works at is a cover for a drug ring, and his family members are murdered by members of the gang, he can avoid fighting no more and decides to confront his corrupt boss.","director":"Lo Wei","poster":"https:\/\/resizing.flixster.com\/WvyyqoJFWn2LRHDyoxb62R9uMRQ=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/IhCC9AZ6JHXaRrf2JWM5E6Arvdw=\/ems.cHJkLWVtcy1hc3NldHMvbW92aWVzL2I0YTQ5ZDQwLTg0MGYtNGNiZi1hZmUyLWU1YTg5OTQzMDRiNS53ZWJw"}
{"title":"The Dark Knight","year":2008,"Time":152,"rating":94,"genre":"Action","description":"With the help of allies Lt. Jim Gordon (Gary Oldman) and DA Harvey Dent (Aaron Eckhart), Batman (Christian Bale) has been able to keep a tight lid on crime in Gotham City. But when a vile young criminal calling himself the Joker (Heath Ledger) suddenly throws the town into chaos, the caped Crusader begins to tread a fine line between heroism and vigilantism.","director":"Christopher Nolan","poster":"https:\/\/resizing.flixster.com\/5ftl4iDlcy3_Ka2cqlzpjs6kv50=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/Wg25mLoPWxjcxXzNyaSF4VGgGE4=\/ems.cHJkLWVtcy1hc3NldHMvbW92aWVzL2ZiNjZiNWFkLWVhNzEtNDRhMC1iNGIwLTFmY2FkNzllNTJlMi5qcGc="}
{"title":"The Equalizer","year":2014,"Time":132,"rating":77,"genre":"Action","description":"Robert McCall (Denzel Washington), a man of mysterious origin who believes he has put the past behind him, dedicates himself to creating a quiet new life. However, when he meets Teri (Chloë Grace Moretz), a teenager who has been manhandled by violent Russian mobsters, he simply cannot walk away. With his set of formidable skills, McCall comes out of self-imposed retirement and emerges as an avenging angel, ready to take down anyone who brutalizes the helpless.","director":"Antoine Fuqua","poster":"https:\/\/resizing.flixster.com\/mYrTH9css-Ue2-f480F5io_aEIQ=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/U5O8tO6OHlLma7h-_hUbXeoioF0=\/ems.cHJkLWVtcy1hc3NldHMvbW92aWVzL2E4YjU3NGQwLWY3NWQtNDk4Ni05MWMzLTlkYjY2NDZkYzVhYi5qcGc="}
{"title":"The Fifth Element","year":1997,"Time":127,"rating":86,"genre":"Action","description":"In the 23rd century, a New York City cabbie, Korben Dallas (Bruce Willis), finds the fate of the world in his hands when Leeloo (Milla Jovovich) falls into his cab. As the embodiment of the fifth element, Leeloo needs to combine with the other four to keep the approaching Great Evil from destroying the world. Together with Father Vito Cornelius (Ian Holm) and zany broadcaster Ruby Rhod (Chris Tucker), Dallas must race against time and the wicked industrialist Zorg (Gary Oldman) to save humanity.","director":"Luc Besson","poster":"https:\/\/resizing.flixster.com\/OS6NXmHya5eQK74GHiJOXLmwk9g=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/-XZAfHZM39UwaGJIFWKAE8fS0ak=\/v3\/t\/assets\/p19352_p_v8_af.jpg"}
{"title":"The French Connection","year":1971,"Time":104,"rating":87,"genre":"Action","description":"New York Detective \"Popeye\" Doyle (Gene Hackman) and his partner (Roy Scheider) chase a French heroin smuggler.","director":"William Friedkin","poster":"https:\/\/resizing.flixster.com\/13dvU51MYAsDE5MoRu3axw1uzU4=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/-XZAfHZM39UwaGJIFWKAE8fS0ak=\/v3\/t\/assets\/p912_p_v8_as.jpg"}
{"title":"The Killer","year":1989,"Time":110,"rating":92,"genre":"Action","description":"Mob assassin Jeffrey (Chow Yun-Fat) is no ordinary hired gun; the best in his business, he views his chosen profession as a calling rather than simply a job. So, when beautiful nightclub chanteuse Jennie (Sally Yeh) is blinded in the crossfire of his most recent hit, Jeffrey chooses to retire after one last job to pay for his unintended victim's sight-restoring operation. But when Jeffrey is double-crossed, he reluctantly joins forces with a rogue policeman (Danny Lee) to make things right.","director":"John Woo","poster":"https:\/\/resizing.flixster.com\/I8e57uJx6VdRQUSkIjuXG519SEE=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/-XZAfHZM39UwaGJIFWKAE8fS0ak=\/v3\/t\/assets\/p8082_p_v8_ab.jpg"}
{"title":"The Matrix","year":1999,"Time":136,"rating":85,"genre":"Action","description":"Neo (Keanu Reeves) believes that Morpheus (Laurence Fishburne), an elusive figure considered to be the most dangerous man alive, can answer his question -- What is the Matrix? Neo is contacted by Trinity (Carrie-Anne Moss), a beautiful stranger who leads him into an underworld where he meets Morpheus. They fight a brutal battle for their lives against a cadre of viciously intelligent secret agents. It is a truth that could cost Neo something more precious than his life.","director":"Lilly Wachowski","poster":"https:\/\/resizing.flixster.com\/sZzZi70xmfdTI7g_UrILEhIoIGY=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/hTz9Ap43sCkvDiFvCkjmb1IWkUg=\/ems.cHJkLWVtcy1hc3NldHMvbW92aWVzL2EwMGEwNmQxLTE1MGYtNGQwYS04ZDhlLWQ0MzYwOTQ5M2JlMC5qcGc="}
{"title":"The Mummy","year":1999,"Time":124,"rating":75,"genre":"Action","description":"The Mummy is a rousing, suspenseful and horrifying epic about an expedition of treasure-seeking explorers in the Sahara Desert in 1925. Stumbling upon an ancient tomb, the hunters unwittingly set loose a 3,000-year-old legacy of terror, which is embodied in the vengeful reincarnation of an Egyptian priest who had been sentenced to an eternity as one of the living dead.","director":"Stephen Sommers","poster":"https:\/\/resizing.flixster.com\/ThtXfTbAa3iDCBfjNQRZ7LNa1BY=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/-XZAfHZM39UwaGJIFWKAE8fS0ak=\/v3\/t\/assets\/p23111_p_v8_ay.jpg"}
{"title":"The nice Guys","year":2016,"Time":116,"rating":79,"genre":"Action","description":"Holland March (Ryan Gosling) is a down-on-his-luck private eye in 1977 Los Angeles. Jackson Healy (Russell Crowe) is a hired enforcer who hurts people for a living. Fate turns them into unlikely partners after a young woman named Amelia (Margaret Qualley) mysteriously disappears. Healy and March soon learn the hard way that some dangerous people are also looking for Amelia. Their investigation takes them to dark places as anyone else who gets involved in the case seems to wind up dead.","director":"Shane Black","poster":"https:\/\/resizing.flixster.com\/D1nI_iMiqSATzwgyEKpttoajYjs=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/-XZAfHZM39UwaGJIFWKAE8fS0ak=\/v3\/t\/assets\/p12356386_p_v8_ae.jpg"}
{"title":"The Professional","year":1994,"Time":106,"rating":95,"genre":"Action","description":"Mathilda (Natalie Portman) is only 12 years old, but is already familiar with the dark side of life: her abusive father stores drugs for corrupt police officers, and her mother neglects her. Léon (Jean Reno), who lives down the hall, tends to his houseplants and works as a hired hitman for mobster Tony (Danny Aiello). When her family is murdered by crooked DEA agent Stansfield (Gary Oldman), Mathilda joins forces with a reluctant Léon to learn his deadly trade and avenge her family's deaths.","director":"Luc Besson","poster":"https:\/\/media.discordapp.net\/attachments\/894196629291286531\/1173607238066245662\/MV5BOTgyMWQ0ZWUtN2Q2MS00NmY0LWI3OWMtNjFkMzZlNDZjNTk0XkEyXkFqcGdeQXVyMjUzOTY1NTc.png?ex=656491ea&is=65521cea&hm=00d0be4209c1d6e62f202095432934d3c69ca8da80754ece0e97239e7b9559a4&=&width=400&height=597"}
{"title":"The Protector","year":2005,"Time":84,"rating":76,"genre":"Action","description":"A young fighter (Tony Jaa) travels to Australia to retrieve stolen elephants that were promised originally to the king of Thailand. Once there, he enlists the aid of a Thai-born Aussie detective to help him achieve his goal, and he uses his fierce Muay Thai moves to battle an evil woman's gang of deadly bodyguards.","director":"Prachya Pinkaew","poster":"https:\/\/media.discordapp.net\/attachments\/894196629291286531\/1174610998938837013\/p162904_p_v8_af.png?ex=656838bd&is=6555c3bd&hm=3b4bd078dd431209798fb2bbd2786e49c3f1dd3b6a5d9c798390f0f4aa11fbee&=&width=412&height=610"}
{"title":"The Raid 1","year":2011,"Time":101,"rating":87,"genre":"Action","description":"A rookie member of an elite team of commandos, Rama (Iko Uwais) is instructed to hang back while his comrades-in-arms go ahead with their mission to take down a brutal crime lord called Tama (Ray Sahetapy). However, the team's cover is blown, and Tama offers sanctuary to every criminal in his high-rise apartment block in exchange for the cops' heads. Now Rama must take command and lead his remaining team on an ultraviolent charge through the building to complete -- and survive -- the mission.","director":"Gareth Evans","poster":"https:\/\/resizing.flixster.com\/ay-M_O6ixWeK-YoGoW-H557cGIg=\/206x305\/v2\/https:\/\/resizing.flixster.com\/-XZAfHZM39UwaGJIFWKAE8fS0ak=\/v3\/t\/assets\/p9005778_p_v8_ab.jpg"}
{"title":"The Raid 2","year":2014,"Time":148,"rating":87,"genre":"Action","description":"After surviving a bloody fight with powerful gangsters, rookie Jakarta cop Rama (Iko Uwais) thinks he can resume a normal life. However, his exploits during that fateful incident have attracted the attention of criminals even more deadly than the last. His family at risk, Rama has no choice but to go under cover. He gets himself thrown in prison, where he befriends the son of a prominent crime kingpin. Rama must lay his own life on the line to finally destroy the criminal empire.","director":"Gareth Evans","poster":"https:\/\/resizing.flixster.com\/NFE-2n_IrZ6bjrowOvyGLUAI7f8=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/-XZAfHZM39UwaGJIFWKAE8fS0ak=\/v3\/t\/assets\/p10503143_p_v8_af.jpg"}
{"title":"The Rock","year":1996,"Time":136,"rating":85,"genre":"Action","description":"FBI chemical warfare expert Stanley Goodspeed (Nicolas Cage) is sent on an urgent mission with a former British spy, John Patrick Mason (Sean Connery), to stop Gen. Francis X. Hummel (Ed Harris) from launching chemical weapons on Alcatraz Island into San Francisco. Gen. Hummel demands $100 million in war reparations to be paid to the families of slain servicemen who died on covert operations. After their SEAL team is wiped out, Stanley and John deal with the soldiers on their own.","director":"Michael Bay","poster":"https:\/\/resizing.flixster.com\/LZqFD1Ochcn98PY8F9ZTYYzD67o=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/-XZAfHZM39UwaGJIFWKAE8fS0ak=\/v3\/t\/assets\/p18099_p_v8_an.jpg"}
{"title":"The Terminator ","year":1984,"Time":108,"rating":89,"genre":"Action","description":"Disguised as a human, a cyborg assassin known as a Terminator (Arnold Schwarzenegger) travels from 2029 to 1984 to kill Sarah Connor (Linda Hamilton). Sent to protect Sarah is Kyle Reese (Michael Biehn), who divulges the coming of Skynet, an artificial intelligence system that will spark a nuclear holocaust. Sarah is targeted because Skynet knows that her unborn son will lead the fight against them. With the virtually unstoppable Terminator in hot pursuit, she and Kyle attempt to escape.","director":"James Cameron","poster":"https:\/\/resizing.flixster.com\/9_MzAhfvN6q29TFxY_GSwSSEmNw=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/-XZAfHZM39UwaGJIFWKAE8fS0ak=\/v3\/t\/assets\/p7764_p_v8_au.jpg"}
{"title":"Three Kings ","year":1999,"Time":115,"rating":77,"genre":"Action","description":"Just after the end of the Gulf War, four American soldiers decide to steal a cache of Saddam Hussein's hidden gold. Led by cynical Sergeant Major Archie Gates (George Clooney), three of the men are rescued by rebels, but Sergeant Troy Barlow (Mark Wahlberg) is captured and tortured by Iraqi intelligence. The Iraqi rebels beg for the American trio to help fight against the impending arrival of Hussein's Elite Guard. The men agree to fight in return for help rescuing Troy.","director":"David O. Russell","poster":"https:\/\/resizing.flixster.com\/I03JTH6Sl4UerOk74cwNXwyHHDA=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/-XZAfHZM39UwaGJIFWKAE8fS0ak=\/v3\/t\/assets\/p23929_p_v8_aa.jpg"}
{"title":"To Live and Die in L.A.","year":1985,"Time":116,"rating":78,"genre":"Action","description":"When his longtime partner on the force is killed, reckless U.S. Secret Service agent Richard Chance (William L. Petersen) vows revenge, setting out to nab dangerous counterfeit artist Eric Masters (Willem Dafoe). Along with his new, straitlaced partner, John Vukovich (John Pankow), Chance sets up a scheme to entrap Masters, resulting in the accidental death of an undercover officer. As Chance's desire for justice becomes an obsession, Vukovich questions the lawless methods he employs.","director":"William Friedkin","poster":"https:\/\/resizing.flixster.com\/iaBTqyBVa3Cz1ak0iF4VLJ-UjzE=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/-XZAfHZM39UwaGJIFWKAE8fS0ak=\/v3\/t\/assets\/p8859_p_v12_aa.jpg"}
{"title":"Top Gun","year":1986,"Time":109,"rating":83,"genre":"Action","description":"The Top Gun Naval Fighter Weapons School is where the best of the best train to refine their elite flying skills. When hotshot fighter pilot Maverick (Tom Cruise) is sent to the school, his reckless attitude and cocky demeanor put him at odds with the other pilots, especially the cool and collected Iceman (Val Kilmer). But Maverick isn't only competing to be the top fighter pilot, he's also fighting for the attention of his beautiful flight instructor, Charlotte Blackwood (Kelly McGillis).","director":"Tony Scott","poster":"https:\/\/resizing.flixster.com\/HIdXWLHyTXVHnHmTMSCc0uKgZ2Y=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/f71tHS8hNz7ZTv8Wxoj4-t3FO4I=\/ems.cHJkLWVtcy1hc3NldHMvbW92aWVzLzhlZDg2NzcxLTNlZWUtNDliNi04YTlkLWNhOTE2OWZiNDc1Ny5qcGc="}
{"title":"Top Gun: Maverick","year":2022,"Time":131,"rating":99,"genre":"Action","description":"After more than thirty years of service as one of the Navy’s top aviators, Pete “Maverick” Mitchell (Tom Cruise) is where he belongs, pushing the envelope as a courageous test pilot and dodging the advancement in rank that would ground him. When he finds himself training a detachment of Top Gun graduates for a specialized mission the likes of which no living pilot has ever seen, Maverick encounters Lt. Bradley Bradshaw (Miles Teller), call sign: “Rooster,” the son of Maverick’s late friend and Radar Intercept Officer Lt. Nick Bradshaw, aka “Goose”. Facing an uncertain future and confronting the ghosts of his past, Maverick is drawn into a confrontation with his own deepest fears, culminating in a mission that demands the ultimate sacrifice from those who will be chosen to fly it.","director":"Joseph Kosinski","poster":"https:\/\/resizing.flixster.com\/V_t9c33NhO_dVwTtCh1s0lRC2To=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/TIM4kfHTVZrfpF0tYt9LIU69A5s=\/ems.cHJkLWVtcy1hc3NldHMvbW92aWVzLzU1OWIwMWQwLWYyZDItNDk4Yi04MDIxLWI3OTJlNDI1NjA3NS5qcGc="}
{"title":"Touch of Zen","year":1971,"Time":180,"rating":83,"genre":"Action","description":"Ku Shen Chai (Chun Shih), an unmotivated artist in his early 30s, still lives with his mother, but he is shaken from his comfortable rut by the arrival of beautiful and mysterious Yang Hui-ching (Feng Hsu), a princess on the run from Gen. Ou-Yang Nin (Tien Peng), who murdered her entire family. Yang brings Ku into her circle of protectors, including Nin's rival, Gen. Shih Wen-Chiao (Pai Ying), and the nameless monk (Roy Chiao) whose spiritual guidance transforms Ku into a valiant fighter.","director":"King Hu","poster":"https:\/\/media.discordapp.net\/attachments\/894196629291286531\/1174611486979661844\/p71683_p_v8_ac.png?ex=65683931&is=6555c431&hm=a5c8598dc84b9160d45d889b3699ae4183f51f5f7edfa5729fc480e44ca5f48a&=&width=412&height=610"}
{"title":"Wonder Woman","year":2017,"Time":141,"rating":83,"genre":"Action","description":"Before she was Wonder Woman (Gal Gadot), she was Diana, princess of the Amazons, trained to be an unconquerable warrior. Raised on a sheltered island paradise, Diana meets an American pilot (Chris Pine) who tells her about the massive conflict that's raging in the outside world. Convinced that she can stop the threat, Diana leaves her home for the first time. Fighting alongside men in a war to end all wars, she finally discovers her full powers and true destiny.","director":"Patty Jenkins","poster":"https:\/\/resizing.flixster.com\/ceWg-__cirAohZIhTwSmqsU310M=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/EwkhPLrOoe17Akas804EJEbjy-Q=\/ems.cHJkLWVtcy1hc3NldHMvbW92aWVzL2Q2MmJhMDFmLTA1ZmYtNDUzYi05YjU4LTllZTZjNTQyY2JlYS53ZWJw"}
{"title":"X2","year":2003,"Time":134,"rating":85,"genre":"Action","description":"Stryker (Brian Cox), a villianous former Army commander, holds the key to Wolverine's (Hugh Jackman) past and the future of the X-Men. This threat re-ignites the call for a mutant registration act. Stryker starts a full-out assault on Professor Xavier's (Patrick Stewart) mansion and school. After escaping his plastic cell, Magneto (Ian McKellen) proposes a partnership with Xavier and the X-Men to combat this new formidable enemy they both have in common.","director":"Bryan Singer","poster":"https:\/\/resizing.flixster.com\/TOH-zcAH1z1hIWo4V8sG-iVljjg=\/fit-in\/180x240\/v2\/https:\/\/resizing.flixster.com\/-XZAfHZM39UwaGJIFWKAE8fS0ak=\/v3\/t\/assets\/p31889_p_v11_ba.jpg"}
{"title":"You Only Live Twice","year":1967,"Time":116,"rating":68,"genre":"Action","description":"During the Cold War, American and Russian spacecrafts go missing, leaving each superpower believing the other is to blame. As the world teeters on the brink of nuclear war, British intelligence learns that one of the crafts has landed in the Sea of Japan. After faking his own death, secret agent James Bond (007) (Sean Connery) is sent to investigate. In Japan, he's aided by Tiger Tanaka (Tetsuro Tamba) and the beautiful Aki (Akiko Wakabayashi), who help him uncover a sinister global conspiracy.","director":"Lewis Gilbert","poster":"https:\/\/resizing.flixster.com\/-XZAfHZM39UwaGJIFWKAE8fS0ak=\/v3\/t\/assets\/p164_p_v10_ab.jpg"}
